/**
 * Програма для створення об'єкту, полем якого є масив чисел Люка.
 * З методами створення самого масиву і визначення усіх чисел із заданого діапазону,
 * що закінчуються на задану цифру
 */
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        /**
         * Підключаю клас Scanner, щоб надалі застосувати метод з цього класу для введення даних
         */
        Scanner input = new Scanner(System.in);

        /**
         * Створюємо змінну шо міститиме в собі масив з числами Люка
         */
        Luke luke1 = new Luke();
        luke1.createLuke();

        /**
         * Створюємо змінну діапазону N. Користувач вводитиме значення, які допустимі для N,
         * а саме не від'ємні числа і число, що не більше за 45 (максимальний номер числа Люка,
         * що можливо записати в Integer)
         */
        int N;
        do {
            System.out.print("Введіть N: ");
            N = input.nextInt();
        }while(N < 0 || N > 45);

        /**
         * Створюємо змінну типу byte, оскільки програмі потрібно тільки цифру.
         * Для отримання значення користувач вводитиме поки не буде число від 0 до 9 включно
         */
        byte last_num;
        do {
            System.out.print("Введіть цифру: ");
            last_num = input.nextByte();
        }while(last_num < 0 || last_num > 9);

        /**
         * Викликаємо метод для виведення усіх чисел із заданого діапазону та з останньою
         * цифрою, що співпадає з введеним користувачес значенням.
         */
        luke1.Nend(N, last_num);

    }
}